
number = int(input("შეიყვანეთ რიცხვი: "))

for i in range(number, -1, -1):
    print(i)





n = int(input("შეიყვანეთ რიცხვი: "))

i = 1 
while i <= n:
    print(i)
    i += 2 










# გამოყენებული მაქსიმალური რიცხვი
n = int(input("შეიყვანეთ რიცხვი: "))

i = 1  # ციკლის დასაწყისი
while i <= n:
    print(i)
    i += 2  # მხოლოდ კენტი რიცხვები







# გამოყენებული მაქსიმალური რიცხვი
n = int(input("შეიყვანეთ რიცხვი: "))

# ლუწი რიცხვების გამოყვანა
for i in range(0, n+1, 2):
    print(i)






# 
# for ციკლი:
# for ციკლი გამოიყენება მაშინ, როდესაც წინასწარ ვიცით რამდენჯერ უნდა შესრულდეს ციკლი.
# მისი ძირითადი ფორმატია: for <variable> in <sequence>: 
# საიტერაციო ცვლადი <variable> გადადის სეკვენციის თითოეულ ელემენტზე.
# მაგალითად, თუ გვაქვს range(5), საიტერაციო ცვლადი i 5-ჯერ გაივლის და
# დაბეჭდავს 0-დან 4-მდე რიცხვებს.
#
# while ციკლი:
# while ციკლი გამოიყენება მაშინ, როდესაც არ ვიცით ზუსტად რამდენჯერ შესრულდება ციკლი,
# არამედ ციკლი შეიძლება გაგრძელდეს, სანამ არ შესრულდება გარკვეული პირობა.
# მაგალითად, "while i < 10:" მიგვითითებს, რომ სანამ i 10-ს არ მიაღწევს, ციკლი უნდა გაგრძელდეს.
#
# საიტერაციო ცვლადი:
# საიტერაციო ცვლადი არის ცვლადი, რომელიც ციკლის დროს ცვალებადობას განიცდის.
# მისი მნიშვნელობა ციკლის თითოეულ ნაბიჯზე იცვლება და თითოეულ ეტაპზე მუშაობს
# ციკლის შიგნით არსებული ლოგიკის შესაბამისად.
